// 1. Задача Перевести название темы на русский язык и закомментировать.

// Переменные

// 2. Задача Создайте многострочный комментарий и поместите следующий текст: 

/*
    Тип number может принимать значения от - 2e53 - 1 до 2e53 - 1 вкл
    При этом может иметь значения, как NaN(Not a Number),
    Так и бесконечность(Infinity / -Infinity)
*/


// 3. Задача Выполнить задачу 2, пользуясь однострочным комментарием.

// Тип number может принимать значения от - 2e53 - 1 до 2e53 - 1 вкл
// При этом может иметь значения, как NaN(Not a Number),
// Так и бесконечность (Infinity / -Infinity)


// 4. Задача cоздайте переменную test, чему равно значение этой переменной? Ответ записать в комментарий.
// let test; // undefined


// 5. Задача cоздайте переменную num и присвойте ей любое число.
// let num = 5;

// 6. Задача cоздайте переменную text и присвойте ей любой текст.
// let text = "мяу";

// 7. Задача cоздайте переменную типа boolean.
// let isUserRelax = true;

// 8. Задача cоздайте переменную с именем variable присвойте ей пустое значение.
// let variable = null;

// 9. Задача cоздайте константную переменную, которая хранит число e (экспонента).
// const EXP = 2.718;

// 10. Задача Создайте константную переменную, которая хранит чёрный цвет для css.
// const BLACK_COLOR = "#000";

// 11. Задача Сделать рефакторинг кода:
// // Variable declarations
// let studlyCapVar;
// let properCamelCase;
// let titleCaseOver;
// // Variable assignments
// studlyCapVar = 10;
// properCamelCase = "A String";
// titleCaseOver = 9000;


// ★ 12. Задача ★ Не выполняя код скажите, что будет если выполнится этот код и почему:


// var numTest = 10;
// var numTest = 15;

// let numberTest = 10;
// let numberTest = 15;

// Вар будет равен 15,а лет выдаст ошибку т.к эта переменная уже объявлялась с другим значением


