// 1. Задача
// Создать массив любой длины, состоящий из чисел. Вывести в консоль количество элементов в массиве.
// const newArray = [1, 4, 5, 6, 7, 8];
// console.log(newArray.length);

// 2. Задача
// Создать массив любой длины, состоящий из чисел. Вывести в консоль индекс последнего элемента. Код должен работать для массива любой длины.
// const newArray = [1, 4, 5, 6, 7, 8];
// console.log(newArray[newArray.length - 1]);

// 3. Задача
// Создать массив любой длины, состоящий из чисел. Вывести в консоль самый первый и последний элементы. Код должен работать для массива любой длины.
// const newArray = [1, 4, 5, 6, 7, 8];
// console.log(newArray[newArray.length - 1]);
// console.log(newArray[0]);

// 4. Задача
// Создать массив любой длины, состоящий из чисел. Вывести значение предпоследнего элемента. Код должен работать для массива любой длины.
// const newArray = [1, 4, 5, 6, 7, 8];
// console.log(newArray[newArray.length-2]);

// 5. Задача
// Создать массив любой длины, состоящий из строк. Удалить последний элемент. А затем добавить 1 элемент в конец массива со значением new. Вывести в консоль получившийся массив.
// const newArray = ['Hi', 'Hood', 'Zyabls'];
// let addVar = "new";
// newArray.pop();
// console.log(newArray);
// newArray.push(addVar);
// console.log(newArray);

// 6. Задача
// Создать массив любой длины, состоящий из строк. Удалить последний элемент и вывести получившийся массив. Затем вывести значение удалённого элемента.
// const newArray = ['Hi', 'Hood', 'Zyabls'];
// newArray.pop();
// console.log(newArray);


// 7. Задача
// Создать массив с любым количеством элементов и любым типом данных внутри. Если элементов больше 5, то вывести в консоль "окей" Иначе ничего не выводить
// const newArray = ['Hi', 'Hood', 'Zyabls'];
// if (newArray.length > 5) {
//     console.log("Okay");
// } else {

// }

// 8. Задача
// Создать массив любой длины, состоящий из чисел. Если последний элемент чётный, то удалить его из массива, а затем вывести в консоль. В противном случае просто вывести первый элемент массива.
// const newArray = [1, 4, 5, 6, 7, 8];
// if (newArray[newArray.length - 1] % 2 === 0) {
//     newArray.pop();
//     console.log(newArray);
// } else {
//     console.log(newArray[0]);
// }

// 9. Задача
// Дан массив чисел. Вывести массив поэлементно в консоль.

// const numberList = [13, 54, 32, 75, 43, 65, 89, 53];
console.log();